{"keras_version": "1.2.2", "config": [{"config": {"b_regularizer": null, "nb_row": 3, "W_regularizer": null, "batch_input_shape": [null, 64, 96, 3], "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "dim_ordering": "tf", "activation": "linear", "border_mode": "same", "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_1", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 3, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_2", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "nb_row": 3, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "border_mode": "same", "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_3", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "nb_row": 3, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_4", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "output_dim": 512, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": 19712}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "output_dim": 3, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": 512}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}